zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Src/py32f031_hal.c
  }
}
#endif

/**
  * @brief  GPIO Analog2 enable.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B,F) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin to be GPIO Analog2
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_EnableGPIOAnalog2(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    SET_BIT(SYSCFG->PA_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    SET_BIT(SYSCFG->PB_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOF)
  {
    SET_BIT(SYSCFG->PF_ANA2EN,GPIO_Pin);
  }
  else
  {
    
  }
}

/**
  * @brief  GPIO Analog2 disable.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B,F) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin to be GPIO Analog2
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_DisableGPIOAnalog2(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    CLEAR_BIT(SYSCFG->PA_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    CLEAR_BIT(SYSCFG->PB_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOF)
  {
    CLEAR_BIT(SYSCFG->PF_ANA2EN,GPIO_Pin);
  }
  else
  {
    
  }
}

/**
  * @brief  Enable I2C pin Signal.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EIIC_PA2
  *            @arg SYSCFG_EIIC_PA3
  *            @arg SYSCFG_EIIC_PA7
  *            @arg SYSCFG_EIIC_PA8
  *            @arg SYSCFG_EIIC_PA9
  *            @arg SYSCFG_EIIC_PA10
  *            @arg SYSCFG_EIIC_PA11
  *            @arg SYSCFG_EIIC_PA12
  *            @arg SYSCFG_EIIC_PB6
  *            @arg SYSCFG_EIIC_PB7
  *            @arg SYSCFG_EIIC_PB8
  *            @arg SYSCFG_EIIC_PB10
  *            @arg SYSCFG_EIIC_PB11
  *            @arg SYSCFG_EIIC_PF0
    *          @arg SYSCFG_EIIC_PF1
  *            @arg SYSCFG_EIIC_PF5
  *            @arg SYSCFG_EIIC_PF6
  * @retval None
  */
void HAL_SYSCFG_EnableI2CPinSignal(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Disable I2C pin Signal.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EIIC_PA2
  *            @arg SYSCFG_EIIC_PA3
  *            @arg SYSCFG_EIIC_PA7
  *            @arg SYSCFG_EIIC_PA8
  *            @arg SYSCFG_EIIC_PA9
  *            @arg SYSCFG_EIIC_PA10
  *            @arg SYSCFG_EIIC_PA11
  *            @arg SYSCFG_EIIC_PA12
  *            @arg SYSCFG_EIIC_PB6
  *            @arg SYSCFG_EIIC_PB7
  *            @arg SYSCFG_EIIC_PB8
  *            @arg SYSCFG_EIIC_PB10
  *            @arg SYSCFG_EIIC_PB11
  *            @arg SYSCFG_EIIC_PF0
    *          @arg SYSCFG_EIIC_PF1
  *            @arg SYSCFG_EIIC_PF5
  *            @arg SYSCFG_EIIC_PF6
  * @retval None
  */
void HAL_SYSCFG_DisableI2CPinSignal(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Enable high driving capability of LED pins.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EHS_PA0
  *            @arg SYSCFG_EHS_PA15
  *            @arg SYSCFG_EHS_PB2
  *            @arg SYSCFG_EHS_PB3
  *            @arg SYSCFG_EHS_PB4
  *            @arg SYSCFG_EHS_PB5
  *            @arg SYSCFG_EHS_PB6
  *            @arg SYSCFG_EHS_PB7
  * @retval None
  */
void HAL_SYSCFG_EnableLEDPinHighDrvSignal(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Disable high driving capability of LED pins.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EHS_PA0
  *            @arg SYSCFG_EHS_PA15
  *            @arg SYSCFG_EHS_PB2
  *            @arg SYSCFG_EHS_PB3
  *            @arg SYSCFG_EHS_PB4
  *            @arg SYSCFG_EHS_PB5
  *            @arg SYSCFG_EHS_PB6
  *            @arg SYSCFG_EHS_PB7
  * @retval None
  */
void HAL_SYSCFG_DisableLEDPinHighDrvSignal(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Enable I2C pin pull-up.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_PU_IIC_PF5
  *            @arg SYSCFG_PU_IIC_PF6
  * @retval None
  */
void HAL_SYSCFG_EnableI2CPinPullUp(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Disable I2C pin pull-up.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_PU_IIC_PF5
  *            @arg SYSCFG_PU_IIC_PF6
  * @retval None
  */
void HAL_SYSCFG_DisableI2CPinPullUp(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Enable GPIO EIIC Signal.
  * @note   To achieve higher code execution efficiency, it is not recommended to use this
  *         function. It is recommended to use function HAL_SYSCFG_EnableI2CPinSignal instead.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B,F) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_EnableGPIOEIICSignal(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {
    if (GPIO_Pin == GPIO_PIN_2)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_3)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_1);
    }
    else if (GPIO_Pin == GPIO_PIN_7)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_2);
    }
    else if (GPIO_Pin == GPIO_PIN_8)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_3);
    }
    else if (GPIO_Pin == GPIO_PIN_9)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_4);
    }
    else if (GPIO_Pin == GPIO_PIN_10)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_5);
    }
    else if (GPIO_Pin == GPIO_PIN_11)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_6);
    }
    else if (GPIO_Pin == GPIO_PIN_12)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_7);
    }
    else
    {
      
