zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Src/py32f031_hal.c
    }
  }
  else if(GPIOx==GPIOB)
  {
    if (GPIO_Pin == GPIO_PIN_6)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_7)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_1);
    }
    else if (GPIO_Pin == GPIO_PIN_8)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_2);
    }
    else if (GPIO_Pin == GPIO_PIN_10)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_3);
    }
    else if (GPIO_Pin == GPIO_PIN_11)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_4);
    }
    else
    {
      
    }
  }
  else if(GPIOx==GPIOF)
  {
    if (GPIO_Pin == GPIO_PIN_0)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_1)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_1);
    }
    else if (GPIO_Pin == GPIO_PIN_5)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_2);
    }
    else if (GPIO_Pin == GPIO_PIN_6)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_3);
    }
    else
    {
      
    }
  }
  else
  {
    
  }
}

/**
  * @brief  Disable GPIO EIIC Signal.
  * @note   To achieve higher code execution efficiency, it is not recommended to use this
  *         function. It is recommended to use function HAL_SYSCFG_DisableI2CPinSignal instead.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B,F) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_DisableGPIOEIICSignal(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {
    if (GPIO_Pin == GPIO_PIN_2)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_3)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_1);
    }
    else if (GPIO_Pin == GPIO_PIN_7)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_2);
    }
    else if (GPIO_Pin == GPIO_PIN_8)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_3);
    }
    else if (GPIO_Pin == GPIO_PIN_9)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_4);
    }
    else if (GPIO_Pin == GPIO_PIN_10)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_5);
    }
    else if (GPIO_Pin == GPIO_PIN_11)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_6);
    }
    else if (GPIO_Pin == GPIO_PIN_12)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EIIC_7);
    }
    else
    {
    }
  }
  else if(GPIOx==GPIOB)
  {
    if (GPIO_Pin == GPIO_PIN_6)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_7)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_1);
    }
    else if (GPIO_Pin == GPIO_PIN_8)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_2);
    }
    else if (GPIO_Pin == GPIO_PIN_10)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_3);
    }
    else if (GPIO_Pin == GPIO_PIN_11)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EIIC_4);
    }
    else
    {
    }
  }
  else if(GPIOx==GPIOF)
  {
    if (GPIO_Pin == GPIO_PIN_0)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_1)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_1);
    }
    else if (GPIO_Pin == GPIO_PIN_5)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_2);
    }
    else if (GPIO_Pin == GPIO_PIN_6)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_EIIC_3);
    }
    else
    {
    }
  }
  else
  {
    
  }
}

/**
  * @brief  Enable GPIO EHS Signal.
  * @note   To achieve higher code execution efficiency, it is not recommended to use this
  *         function. It is recommended to use function HAL_SYSCFG_EnableLEDPinHighDrvSignal instead.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_EnableGPIOEhsSignal(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {
    if (GPIO_Pin == GPIO_PIN_0)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EHS_0);
    }
    else if (GPIO_Pin == GPIO_PIN_15)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EHS_1);
    }
    else
    {
    }
  }
  else if(GPIOx==GPIOB)
  {
    if (GPIO_Pin == GPIO_PIN_2)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_0);
    }
    else if (GPIO_Pin == GPIO_PIN_3)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_1);
    }
    else if (GPIO_Pin == GPIO_PIN_4)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_2);
    }
    else if (GPIO_Pin == GPIO_PIN_5)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_3);
    }
    else if (GPIO_Pin == GPIO_PIN_6)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_4);
    }
    else if (GPIO_Pin == GPIO_PIN_7)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_5);
    }
    else
    {
    }
  }
  else
  {
    
  }
}

/**
  * @brief  Disable GPIO EHS Signal.
  * @note   To achieve higher code execution efficiency, it is not recommended to use this
  *         function. It is recommended to use function HAL_SYSCFG_DisableLEDPinHighDrvSignal instead.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_DisableGPIOEhsSignal(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {
    if (GPIO_Pin == GPIO_PIN_0)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EHS_0);
    }
    else if (GPIO_Pin == GPIO_PIN_15)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PA_EHS_1);
    }
    else
    {
    }
  }
  else if(GPIOx==GPIOB)
  {
    if (GPIO_Pin == GPIO_PIN_2)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_0);
    }
    else if (GPIO_Pin == GPIO_PIN_3)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_1);
    }
    else if (GPIO_Pin == GPIO_PIN_4)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_2);
    }
    else if (GPIO_Pin == GPIO_PIN_5)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_3);
    }
    else if (GPIO_Pin == GPIO_PIN_6)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_4);
    }
    else if (GPIO_Pin == GPIO_PIN_7)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PB_EHS_5);
    }
    else
    {
    }
  }
  else
  {
    
