zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Src/py32f031_hal.c
  }
}

/**
  * @brief  I2C_PU type IO 4.7K pull-up resistor control enable.
  * @note   To achieve higher code execution efficiency, it is not recommended to use this
  *         function. It is recommended to use function HAL_SYSCFG_EnableI2CPinPullUp instead.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (F) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_EnableGPIOI2cPullUp(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOF)
  {
    if (GPIO_Pin == GPIO_PIN_5)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_PU_IIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_6)
    {
      SET_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_PU_IIC_1);
    }
    else
    {
    }
  }
  else
  {
  }
}

/**
  * @brief  I2C_PU type IO 4.7K pull-up resistor control disable.
  * @note   To achieve higher code execution efficiency, it is not recommended to use this
  *         function. It is recommended to use function HAL_SYSCFG_DiableI2CPinPullUp instead.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (F) to select the GPIO peripheral for PY32F0 family
  * @param  GPIO_Pin specifies the pin
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_DisableGPIOI2cPullUp(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOF)
  {
    if (GPIO_Pin == GPIO_PIN_5)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_PU_IIC_0);
    }
    else if (GPIO_Pin == GPIO_PIN_6)
    {
      CLEAR_BIT(SYSCFG->IOCFG, SYSCFG_IOCFG_PF_PU_IIC_1);
    }
    else
    {
    }
  }
  else
  {
  }
}

/**
  * @}
  */



/**
  * @}
  */

#endif /* HAL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
